alanbjohnston/PiSSTVpp/esp32sstvpp/esp32sstvpp.cpp
// PiSSTVpp

// 2013 Robert Marshall KI4MCW
// 2014 Gerrit Polder, PA3BYA fixed header. 
// 2014 Don Gi Min, KM4EQR, more protocols and option handling

// Ported to ESP32 and turned into a library by Alan Johnston, KU2Y

#include "esp32sstvpp.h"
#include <driver/ledc.h> 
//#include "esp_timer.h"
#include "freertos/timers.h"

// =========
// globals
// =========
#ifdef SSTV_PWM
uint16_t   g_audio[2];
#else
uint16_t   g_audio[MAXSAMPLES] ;
#endif
uint32_t   g_scale, g_samples ;
double     g_twopioverrate , g_uspersample ; 
double     g_theta, g_fudge ; 
uint8_t    g_protocol; //VIS ID's for SSTV protocols
long	avg_time = 0;

FILE *     g_imgfp ;
FILE *     g_outfp ;
//gdImagePtr g_imgp ;
uint16_t   g_rate;

 File input_file;
 File output_file;
// File inFile;
  File outFile;
  byte sstv_pwm_pin;
  bool sstv_stop = false;
  bool sstv_stop_write = false;
  unsigned long sstv_micro_timer;
  int sstv_period;
  long prompt_count_max;
  long prompt_count;	

void picosstvpp_begin(int pin) {
	
//	     Serial.println(micros() - sstv_micro_timer);	
  sstv_pwm_pin = pin;	
//  delay(10000);	
//  Serial.begin(115200);	
  Serial.println("picosstvpp v0.4 starting");	
//  show_dir4();	
//  load_files();
//  LittleFS.remove("/cam.pwm");
//  LittleFS.remove("/sstv_image_1_320_x_240.jpg");
//  LittleFS.remove("/sstv_image_2_320_x_240.jpg");
//  LittleFS.remove("/cam2.bin");
//  LittleFS.remove("/cam.bin");
	
//  Serial.println("Deleted .bin and .pwm files");	
//  show_dir4();
//  SPIFFS.begin();	

// config ESP32 PWM (LEDC)
		
  ledc_timer_config_t pwm_timer;
	
  pwm_timer.timer_num = LEDC_TIMER_1;
  pwm_timer.speed_mode = LEDC_HIGH_SPEED_MODE;
  pwm_timer.duty_resolution = LEDC_TIMER_8_BIT;
  pwm_timer.freq_hz = 200000;
	
  ledc_timer_config(&pwm_timer);
	
	
  ledc_channel_config_t pwm_config;
  
  pwm_config.channel = LEDC_CHANNEL_3;
  pwm_config.timer_sel = LEDC_TIMER_1;
  pwm_config.gpio_num = 2;
  pwm_config.speed_mode = LEDC_HIGH_SPEED_MODE;
  pwm_config.duty = 2;
  pwm_config.hpoint = 0;
  
  ledc_channel_config(&pwm_config);	
	
  ledc_set_duty(LEDC_HIGH_SPEED_MODE, LEDC_CHANNEL_3, 0);
  ledc_update_duty(LEDC_HIGH_SPEED_MODE, LEDC_CHANNEL_3);

  Serial.println("Testing PWM");
  delay(500);
  ledc_set_duty(LEDC_HIGH_SPEED_MODE, LEDC_CHANNEL_3, 127);
  ledc_update_duty(LEDC_HIGH_SPEED_MODE, LEDC_CHANNEL_3);	
  delay(500);
  ledc_set_duty(LEDC_HIGH_SPEED_MODE, LEDC_CHANNEL_3, 255);
  ledc_update_duty(LEDC_HIGH_SPEED_MODE, LEDC_CHANNEL_3);	
  delay(500);
  ledc_set_duty(LEDC_HIGH_SPEED_MODE, LEDC_CHANNEL_3, 0);
  ledc_update_duty(LEDC_HIGH_SPEED_MODE, LEDC_CHANNEL_3);
  delay(500);
  ledc_set_duty(LEDC_HIGH_SPEED_MODE, LEDC_CHANNEL_3, 127);
  ledc_update_duty(LEDC_HIGH_SPEED_MODE, LEDC_CHANNEL_3);
  delay(500);
  ledc_set_duty(LEDC_HIGH_SPEED_MODE, LEDC_CHANNEL_3, 255);
  ledc_update_duty(LEDC_HIGH_SPEED_MODE, LEDC_CHANNEL_3);	
  delay(500);
  ledc_set_duty(LEDC_HIGH_SPEED_MODE, LEDC_CHANNEL_3, 127);
  ledc_update_duty(LEDC_HIGH_SPEED_MODE, LEDC_CHANNEL_3);	
	
	
}

// ================
//   main
// ================

// int main(int argc, char *argv[]) {
void picosstvpp() {
	
  g_rate = WRAP * 4400; //RATE;	
  float multiplier;
  int wrap = WRAP;  // was 10; // 5;
  int dds_pin_slice;
  //pwm_config dds_pwm_config;
  sstv_period = 1E6 / g_rate;  // clock
  char octet;
  byte lower;
  byte upper;
  Serial.println("Playing PWM file");	

	 
  int  dds_pwm_pin = 26;
   
//    multiplier = 133E6 / (clock * (wrap + 1));
//    multiplier = 133E6 / (g_rate * (wrap + 1));
//    multiplier = 125E6 / (clock * (wrap + 1));
	
//    isr_period = (int) ( 1E6 / clock + 0.5);
/*    
    Serial.printf("Pico PWM Playback v0.4 begin\nClock: %d Wrap: %d Multiplier: %4.1f Period: %d\n", g_rate, wrap, multiplier, sstv_period);

    gpio_set_function(dds_pwm_pin, GPIO_FUNC_PWM);
    dds_pin_slice = pwm_gpio_to_slice_num(dds_pwm_pin);

    dds_pwm_config = pwm_get_default_config();
    pwm_config_set_clkdiv(&dds_pwm_config, multiplier); // was 100.0 50 75 25.0); // 33.333);  // 1.0f
    pwm_config_set_wrap(&dds_pwm_config, wrap); // 3 
    pwm_init(dds_pin_slice, &dds_pwm_config, true);
    pwm_set_gpio_level(dds_pwm_pin, 0); // (dds_pwm_config.top + 1) * 0.5);
*/  
//    Serial.printf("PWM config.top: %d\n", dds_pwm_config.top);
	
//  delay(1000);	 
	
// while (true) {	
	
//  output_file = LittleFS.open("/cam.pwm", "r");
	
  prompt_count_max = 4 * 1E6 / sstv_period;
  prompt_count = 0;	
	
  sstv_micro_timer = esp_timer_get_time ();  //micros();	
	
    char *protocol; 
    int option;
    sstv_stop = false;
    sstv_stop_write = false;

    g_protocol = 56; //Scottie 2
/*	
    while ((option = getopt(argc, argv, "r:p:")) != -1) {
        switch (option) {
            case 'r':
                g_rate = (atoi(optarg));
                break;
            case 'p':
                protocol = optarg;
                break;
        }
    }

    //Set VIS codes
    if ( strcmp(protocol, "m1") == 0 ) {
        g_protocol = 44; //Martin 1
    }
    else if ( strcmp(protocol,"m2") == 0) {
        g_protocol = 40; //Martin 2
    }
    else if ( strcmp(protocol,"s1") == 0) {
        g_protocol = 60; //Scottie 1
    }
    else if ( strcmp(protocol,"s2") == 0) {
        g_protocol = 56; //Scottie 2
    }
    else if ( strcmp(protocol,"sdx") == 0) {
        g_protocol = 76; //Scottie DX
    }
    else if ( strcmp(protocol,"r36") == 0) {
        g_protocol = 8; //Robot 36
    }
    else {
        printf("Unrecognized protocol option %s, defaulting to Martin 1...\n\n", protocol);
        g_protocol = 44;
    }
*/

    // locals
    uint32_t starttime = millis();	 // time(NULL) ;	
    uint8_t ft ; 
    char inputfile[255], outputfile[255] ;
    
    // string hygeine
    memset( inputfile  , 0 , 255 ) ;
    memset( outputfile , 0 , 255 ) ;
    
    // assign values to globals

    double temp1, temp2, temp3 ;
    temp1 = (double)( 1 << (BITS - 1) ) ;
    temp2 = VOLPCT / 100.0 ;
    temp3 = temp1 * temp2 ;
    g_scale = (uint32_t)temp3 ;
    
    g_twopioverrate = 2.0 * M_PI / g_rate ;
    g_uspersample = 1000000.0 / (double)g_rate ;

    g_theta = 0.0 ;
    g_samples = 0.0 ;
    g_fudge = 0.0 ;

    Serial.printf( "Constants check:\n" ) ;
    Serial.printf( "      rate = %d\n" , g_rate ) ;
    Serial.printf( "  VIS code = %d\n" , g_protocol);
#ifndef SSTV_PWM		
    Serial.printf( "      BITS = %d\n" , BITS ) ;
    Serial.printf( "    VOLPCT = %d\n" , VOLPCT ) ; 
    Serial.printf( "     scale = %d\n" , g_scale ) ;
#endif	
    Serial.printf( "   us/samp = %f\n" , g_uspersample ) ;
    Serial.printf( "   2p/rate = %f\n\n" , g_twopioverrate ) ;
/*    
    // set filenames    
    strncpy( inputfile , argv[optind] , strlen( argv[optind] ) ) ;
    ft = filetype( inputfile ) ;
    if ( ft == FILETYPE_ERR ) 
    {
        printf( "Exiting.\n" ) ;
        return 2 ;
    }
    
