alanbjohnston/PiSSTVpp/esp32sstvpp/esp32sstvpp.cpp
    strncpy( outputfile, inputfile , strlen( inputfile ) ) ;
    
#ifdef AUDIO_AIFF    
    strcat( outputfile , ".aiff" ) ;
#endif
#ifdef AUDIO_WAV    
    strcat( outputfile , ".wav" ) ;
#endif
    
    printf( "Input  file is [%s].\n" , inputfile ) ;
    printf( "Output file is [%s].\n" , outputfile ) ;
    
    // prep
    
    g_imgfp = fopen( inputfile , "r" ) ;
    g_outfp = fopen( outputfile , "w" ) ;
    printf( "FILE ptrs opened.\n" ) ;
    
    if ( ft == FILETYPE_JPG ) 
    { g_imgp = gdImageCreateFromJpeg( g_imgfp ) ; }
    else if ( ft == FILETYPE_PNG ) 
    { g_imgp = gdImageCreateFromPng( g_imgfp ) ; }
    else {
        printf( "Some weird error!\n" ) ;
        return 3 ;
    }    
*/    
//    input_file = LittleFS.open("/cam.bin", "r");
    input_file = SPIFFS.open("/cam.bin", "r");
	
#ifdef WAV	
    output_file = LittleFS.open("/cam.wav", "w+");	
#endif	
#ifdef SSTV_PWM	
//    output_file = LittleFS.open("/cam.pwm", "w+");	
#endif	
/*	
    if (output_file)
      Serial.printf( "Output file opened.\n" );
    else
      Serial.printf( "Error opening output file.\n" );	    
*/
    // go!

    addvisheader() ;
/**/    
    //Selects audio format mode
    switch (g_protocol) {
        case 44: //Martin 1
            buildaudio_m(457.6);
            break;
        case 40: //Martin 2
            buildaudio_m(228.8);
            break;
        case 60: //Scottie 1
            buildaudio_s(432.0);
            break;
        case 56: //Scottie 2
            buildaudio_s(275.2);  // 275.2 is original code
//	     buildaudio_s(274.0);  // was 274.4 no stripe (vertical band), 274.7 - 1 stripe instead of 3 for 275.2, 274.9 2 stripes, 275.5 auto ML280
            break;
        case 76: //Scottie DX
            buildaudio_s(1080.0);
            break;
        case 8: //Robot 36
            buildaudio_r36();
            break;
        default:
            Serial.printf("Something went horribly wrong: unknown protocol while building audio!\n");
 //           exit(2);
            break;
    }

    if (!sstv_stop)
      addvistrailer() ;
/**/	
    
#ifdef AUDIO_AIFF    
    writefile_aiff() ;
#endif
#ifdef AUDIO_WAV
    writefile_wav();
#endif    

    // cleanup

//    fclose( g_imgfp ) ;
//    fclose( g_outfp ) ;
	
    input_file.close();
    output_file.close();	
    // brag
    
    uint32_t endtime = millis();	// time(NULL) ;
    Serial.printf( "Created output file in %d milliseconds.\n" , ( endtime - starttime ) ) ;
	
//    show_dir4();
//    delay(1000);	
//    play_pwm_file();
//    delay(10000);	
//    return 0 ;
}


// =====================
//  subs 
// =====================    


// filetype -- Check to see if input file is in one of our
//             supported formats (currently jus JPEG and PNG).
//             Uses libmagic.

/*
uint8_t filetype( char *filename ) {
    magic_t m ;
    char m_str[ MAGIC_CNT + 2 ] ;
    uint8_t retval ;
    
    printf( "  Checking filetype for file [%s]\n" , filename ) ;
    
    retval = FILETYPE_ERR ;
    
    m = magic_open( MAGIC_NONE ) ;
    if ( m && ( magic_load(m, NULL) == 0 ) )
    {
        strncpy(m_str, magic_file(m, filename), MAGIC_CNT+1) ;
        
        if ( strncmp(m_str, MAGIC_JPG, MAGIC_CNT) == 0 )
        { 
            printf( "  File is a JPEG image.\n" ) ;
            retval = FILETYPE_JPG ; 
        }
        
        else if ( strncmp(m_str, MAGIC_PNG, MAGIC_CNT) == 0 )
        { 
            printf( "  File is a PNG image.\n" ) ;
            retval = FILETYPE_PNG ; 
        }
        
        else
        {
            printf( "  This file format is not supported!\n" ) ;
            printf( "  Please use a JPEG or PNG file instead.\n" ) ;
        }    
    }
    
    if ( m ) { magic_close(m) ; }
    
    return retval ;
}
*/

// playtone -- Add waveform info to audio data. New waveform data is 
//             added in a phase-continuous manner according to the 
//             audio frequency and duration provided. Note that the
//             audio is still in a purely hypothetical state - the
//             format of the output file is not determined until 
//             the file is written, at the end of the process.
//             Also, yes, a nod to Tom Hanks.

void playtone( uint16_t tonefreq , double tonedur ) {
#ifdef SSTV_PWM
    int voltage;
    tonedur = (((float)(tonedur)) / 1.07) + 0.5;
    tonefreq = (((float)(tonefreq)) * 1.07) + 0.5;	
#else
    uint16_t voltage;	
#endif	
    uint16_t tonesamples, i ;
    double   deltatheta ;
    
//    tonefreq += 20;  // increase frequency by 20 Hz
//    tonefreq *= 1.01333;  // increase frequency by scale.

	
    tonedur += g_fudge ;
    tonesamples = ( tonedur / g_uspersample ) + 0.5 ;
/*	
    if (tonesamples > MAXSAMPLES) {
	Serial.printf("Tonesamples overflow: %d \n", tonesamples); 
	tonesamples = MAXSAMPLES - 1;    
    }
*/	
    deltatheta = g_twopioverrate * tonefreq ;
    
//    for ( i=1 ; (i<=tonesamples && !sstv_stop_write && !sstv_stop && !Serial.available() && !BOOTSEL && digitalRead(10)); i++ ) {
    for ( i=1 ; (i<=tonesamples && !sstv_stop_write && !sstv_stop); i++ ) {
#ifdef AUDIO_AIFF        
        g_samples++ ;
        
        if ( tonefreq == 0 ) { g_audio[i] = 32768 ; }
        else {

            voltage = 32768 + (int)( sin( g_theta ) * g_scale ) ;
            g_audio[i] = voltage ;
            g_theta += deltatheta ;

        }
#endif
#ifdef AUDIO_WAV
        g_samples++ ;
        
        if ( tonefreq == 0 ) { g_audio[i] = 32768 ; }
        else {

            voltage =     0 + (int)( sin( g_theta ) * g_scale ) ;
            g_audio[i] = voltage ;
            g_theta += deltatheta ;

        }
#endif    
#ifdef SSTV_PWM
//	for(int j = 0; j < 2; j++) {	
          g_samples++ ;
 
//          if ( tonefreq == 0 ) { g_audio[j] = 32768 ; }		
          if ( tonefreq == 0 ) 
//	      g_audio[j] = (WRAP + 1)/2; 
	      voltage = 127; // (WRAP + 1)/2; 
          else {

//            voltage =     3 + (int)( sin( g_theta ) * 4.0 ) ;  // wrap 5+1
//            voltage =     (WRAP + 1)/2 + (int)( sin( g_theta ) * (float)((WRAP + 1)/2 + 0)) ; //   range is 1 to wrap - 1
//            voltage =     (255/WRAP) * ((WRAP + 1)/2 + (int)( sin( g_theta ) * (float)((WRAP + 1)/2 + 1))) ; //   range is 1 to wrap - 1
            voltage = 127 + (127.0 * sin( g_theta )); //   range is 0 to 254

	    if (voltage < 0)
	      voltage = 0;	    
/*		  
           int sine =  sin( g_theta ) * (float)((WRAP + 1)/2 + 1);
	   if (sine < ((-1)*((WRAP + 1)/2)))
	     sine = (WRAP + 1)/2;	   
           voltage = (WRAP + 1)/2 + sine ; 
*/		  
		  
