alanbjohnston/PiSSTVpp/esp32sstvpp/esp32sstvpp.cpp
//	    Serial.println(voltage);	
//	    g_audio[j] = voltage ;
            g_theta += deltatheta ;	

          }
// play it	
	 while ((esp_timer_get_time () - sstv_micro_timer) < sstv_period)    { }

//    	 pwm_set_gpio_level(sstv_pwm_pin, voltage);	    
         ledc_set_duty(LEDC_HIGH_SPEED_MODE, LEDC_CHANNEL_3, voltage);
         ledc_update_duty(LEDC_HIGH_SPEED_MODE, LEDC_CHANNEL_3);
	    
    	 sstv_micro_timer = esp_timer_get_time ();  //micros();  
	    
//	 Serial.print(voltage);
//	 Serial.print(",");   
/*	  

	    prompt_count++;
	    if (prompt_count > prompt_count_max) {
		prompt_count = 0;
	//	Serial.println("Prompt!\n");   
		if (Serial.available() || BOOTSEL || !digitalRead(10))
//		if (BOOTSEL || !digitalRead(10))
		  sstv_stop = true;  
//		Serial.printf("a: %f4.1 ", (float)avg_time/(float)prompt_count_max); 
//		avg_time = 0;    
	    }
	    
*/	    
//	}
/*	    
	byte octet = (g_audio[0] & 0xf) + (((g_audio[1] & 0xf)) << 4);    
	int result = output_file.write(octet);
	if (result < 1) {
	  sstv_stop_write = true;
	  Serial.println("Output file write error");	
	}
*/	    
//	i++;   	    
#endif  		

    } // end for i        
    
    g_fudge = tonedur - ( tonesamples * g_uspersample ) ;
/*	
    for ( i=1 ; i<=tonesamples ; i++ ) {
#ifdef SSTV_PWM
 
#endif
//	output_file.write(g_audio[i] & 0xff00);  
    }
*/	
}  // end playtone    

/*
uint16_t toneval_rgb ( uint8_t colorval ) {
    return ( ( 800 * colorval ) / 256 ) + 1500 ;
}
*/
#define toneval_rgb(colorval) ((( 800 * colorval) / 256) + 1500) 

uint16_t toneval_yuv ( uint8_t colorval ) {
    return ( (float)colorval * 3.1372549 ) + 1500.0 ;
}    

// addvisheader -- Add the specific audio tones that make up the 
//                 Martin 1 VIS header to the audio data. Basically,
//                 this just means lots of calls to playtone(). 

void addvisheader() {
    printf( "Adding VIS header to audio data.\n" ) ;
    
    // bit of silence

/**/	
    playtone(1500, 900000);
    playtone(1500, 900000);
    playtone(1500, 900000);
    playtone(1500, 900000);
    playtone(1500, 900000);
    playtone(1500, 900000);
    playtone(1500, 900000);
    playtone(1500, 900000);
    playtone(1500, 900000);
    playtone(1500, 900000);
	
    playtone(2000, 900000);
    playtone(2000, 900000);
    playtone(2000, 900000);
    playtone(2000, 900000);
    playtone(2000, 900000);
    playtone(2000, 900000);
    playtone(2000, 900000);
    playtone(2000, 900000);
    playtone(2000, 900000);
    playtone(2000, 900000);	
	
//  sstv_stop_write = true;
	
//    return;	
/**/	
    playtone(    0 , 500000 ) ;   
	
    // attention tones
    playtone( 1900 , 100000 ) ; // you forgot this one
    playtone( 1500 , 100000 ) ;
    playtone( 1900 , 100000 ) ;
    playtone( 1500 , 100000 ) ;
    playtone( 2300 , 100000 ) ;
    playtone( 1500 , 100000 ) ;
    playtone( 2300 , 100000 ) ;
    playtone( 1500 , 100000 ) ;
                    
    // VIS lead, break, mid, start
    playtone( 1900 , 300000 ) ;
    playtone( 1200 ,  10000 ) ;
    playtone( 1900 , 300000 ) ;
    playtone( 1200 ,  30000 ) ;

    int i;
    int parity = 0;

    //write VIS data tones
    for(i = 1; i <= 64; i = i<<1) {
        if(i & g_protocol) { //digit is a 1
            playtone(1100, 30000);
            parity = !parity;
        }
        else {
            playtone(1300, 30000); //digit is a 0
        }
    }

    //parity bit
    if(parity) //odd parity
        playtone(1100, 30000);
    else       //even parity
        playtone(1300, 30000);

    // VIS stop
    playtone( 1200 ,  30000 ) ; 
    Serial.printf( "Done adding VIS header to output file.\n" ) ;
        
} // end addvisheader   

//Builds audio scan data for the Martin series of specifications.
//Applicable to Martin 1 and Martin 2 SSTV modes
//Each pixel is scanned for pixeltime microseconds
void buildaudio_m (double pixeltime) {
    uint16_t x , y , k ;
    uint32_t pixel ;
    uint8_t r[320], g[320], b[320] ;
    
    char buff[3];
	
     for ( y=0 ; y<256 ; y++ ) {
	        
        // read image data
        for ( x=0 ; x<320 ; x++ ) {
//            pixel = gdImageGetTrueColorPixel( g_imgp, x, y ) ;
		
//	 input_file.readBytes(buff, 3);
          
          r[x] =  buff[0];
          g[x] =  buff[1];
          b[x] =  buff[2];	
            //printf( "Got pixel.\n" ) ;
            
            // get color data
//            r[x] = gdTrueColorGetRed( pixel ) ;
//            g[x] = gdTrueColorGetGreen( pixel ) ;
//            b[x] = gdTrueColorGetBlue( pixel ) ;
        }
        
        // add row markers to audio
        // sync
        playtone( 1200 , 4862 ) ;
        // porch 
        playtone( 1500 ,  572 ) ;
        
        // each pixel is 457.6us long in Martin 1
        
        // add audio for green channel for this row
        for ( k=0 ; k<320 ; k++ )
        { playtone( toneval_rgb( g[k] ) , pixeltime ) ; }
        
        // separator tone 
        playtone( 1500 , 572 ) ;
        
        // bloo channel
        for ( k=0 ; k<320 ; k++ )
        { playtone( toneval_rgb( b[k] ) , pixeltime ) ; }

        playtone( 1500 , 572 ) ;

        // red channel
        for ( k=0 ; k<320 ; k++ )
        { playtone( toneval_rgb( r[k] ) , pixeltime ) ; }

        playtone( 1500 , 572 ) ;
        
    }  // end for y
    
    printf( "Done adding image to audio data.\n" ) ;    
    
}  // end buildaudio_m   

//Builds audio scan data for the Scottie series of specifications.
//Applicable to Scottie 1, Scottie 2, Scottie  SSTV modes
//Each pixel is scanned for pixeltime microseconds
void buildaudio_s (double pixeltime) {
    uint16_t x , y , k ;
    uint32_t pixel ;
    uint8_t r[320], g[320], b[320]; 
//    char buff_row[320 * 2] ;
    char buff_row[320 * 3] ;
    
    Serial.printf( "Adding image to output file.\n" ) ;
	
//    char buff[3];
    char buff[2];
    uint16_t pixel_value;	
	    
    //add starting sync pulse
    playtone( 1200 , 9000);

//    for ( y=0 ; y<256 ; y++ ) {
//    for ( y=0 ; y<100 ; y++ ) {
    for ( y=0 ; ((y<240) && !sstv_stop_write  && !sstv_stop) ; y++ ) {
        // read image data
//	Serial.println("Starting row");    
	input_file.readBytes(buff_row, sizeof(buff_row));    
        for ( x=0 ; ((x<320) && !sstv_stop_write && !sstv_stop) ; x++ ) {
/*
	if ( x < 100) {
		r[x] = 0xff;
		g[x] = 0;		
		b[x] = 0;	
	}
	else if ( x < 200) {
		r[x] = 0;
		g[x] = 0xff;		
		b[x] = 0;	
	}
	else {	
		r[x] = 0;
		g[x] = 0;		
		b[x] = 0xff;	
	}
*/		
		/**/
//	    input_file.readBytes(buff, 3);
///	    input_file.readBytes(buff, 2);
		
//	    pixel_value = buff[0] + (buff[1] << 8);  // back		
//	    pixel_value = buff_row[2 * x] + (buff_row[(2 * x) + 1] << 8);  
/*		
           Serial.print(pixel_value, HEX);
  	   Serial.print(" ^ ");
		
           Serial.print(buff[1], HEX);
	  Serial.print(" ");
           Serial.print(buff[0], HEX);
	  Serial.print(" | ");
*/		
//            byte red_raw = (pixel_value & 0b1111100000000000) >> 11;
//            byte green_raw = (pixel_value & 0b0000011111100000) >> 5;         
//            byte blue_raw = (pixel_value & 0b0000000000011111);   	
/*		
	    Serial.print(red_raw, HEX);
	    Serial.print(" ");
	    Serial.print(green_raw, HEX);
	    Serial.print(" ");
	    Serial.print(blue_raw, HEX);
	    Serial.print(" / ");			
*/		
//            r[x] = (float)(red_raw) * 255.0/31.0;
//            g[x] = (float)(green_raw) * 255.0/63.0;
//            b[x] = (float)(blue_raw) * 255.0/31.0;    
		
            r[x] = buff_row[0];
            g[x] = buff_row[1];
            b[x] = buff_row[2];    		
		
